{
  "traditional": [
    "tell me about yourself",
    "what are your goals?",
    "what are your strengths?",
    "what is your greatest weakness?",
    "how would you describe your personality?",
    "when have you been most motivated?",
    "describe your leadership or management style",
    "what do you value the most in a teammate?",
    "what are the most important things for you in a job/company?",
    "how do you stay current and informed on industry trends and technology?",
    "do you believed your overqualified for this position?",
    "if I remember one thing about you, what shoud it be?",
    "what are your salary expectations?",
    "what experiences do you have that qualifies you for this job?",
    "why do you want to work here?",
    "why should we hire you?",
    "where do you see yourself in five years?",
    "what is your greatest achievement?",
    "are you a team player?",
    "do you have any questions for us?",
    "give an example of where you've been able to use your leadership skills",
    "what can you bring to the company?",
    "how did you hear about this position?",
    "why do you want this job?",
    "how do you define success?",
    "how do your skills align with this role?",
    "what makes you unique?"
  ],
  "behavioral": [
    "provide an example of a time when you didn’t agree with other programmers. did you stand up for something that you believed was right?",
    "tell me about an instance when you had to communicate a really bad piece of news to your supervisor or team members. How did you handle it? What was the outcome?",
    "tell me about a situation in which you had to speak up and be assertive in order to get a point across that was important to you.",
    "what would you do if you misunderstood an important task on the job? give me an example.",
    "tell me about a time when you successfully explained a technical problem to a colleague or a customer who didn’t have a tech background.",
    "tell me about a time when you had to work with someone completely different from you. How did you adapt to collaborate better?",
    "describe a team experience you found disappointing. What would you have done differently to prevent this?",
    "how do you handle disagreements with co-workers?",
    "tell me about a situation when you made a mistake at work. What happened exactly and how did you deal with it? what steps did you take to improve the situation?",
    "walk me through a difficult/complex problem/project you encountered. how did you decide what to do first? what information did you need? what obstacles did you face? which ones were you able to overcome? did you have to ask for help?",
    "what is the biggest problem you have faced on projects so far and how did you solve it? what made the problem difficult to resolve? what was the result? would you do anything differently now?",
    "provide an example of an important project goal you reached and how you achieved it.",
    "describe a circumstance when you were not able to achieve a project goal that was set by your supervisor. how did you handle this situation? what was the outcome?",
    "give me an example of a time when you were faced with a complex project-related matter and you could not decide on the best way to deal with it. what did you do? how did you go about making the decision – lead me through your decision process. if you could make the decision once again, would you change anything?",
    "think about a situation when you made a poor decision or did something that just didn’t turn out right. what happened?",
    "how do you handle a disagreement with your colleagues? give me an example of when you successfully persuaded someone to see things your way at work.",
    "has there been a time on a project when you disagreed with someone? what did you do about it?",
    "tell me about when you had to deal with conflict within your team. how was the conflict solved? how did you handle that? how would you deal with it now?",
    "give me an example of when you had to suddenly perform under pressure. what happened and how did you handle it?",
    "describe a situation when you worked effectively under pressure. how did you feel when working under pressure? what was going on, and how did you get through it?",
    "tell me about a time when you successfully delegated tasks to your team.",
    "can you tell me about a time when you had to perform a task or work on a project you had no previous experience before? how did you approach this situation and what did you learn?"
  ],
  "resume": [
    "tell me about your experiences",
    "tell me about these projects"
  ],
  "do you know yourself?": [
    "who are you?",
    "strenghts",
    "skills",
    "motivator",
    "likes & dislikes",
    "what do you look for in a job?"
  ],
  "web development": [
    "what skills should a good web developer have?",
    "are you aware of the roles and responsibilities of a web developer?",
    "what are the added benefits of HTTP/2 compared to HTTP 1.1?",
    "can you list a few ways to speed up page loading?",
    "how is XHTML different from HTML?",
    "explain webpack.",
    "list out newly introduced input types, APIs, form elements, and elements that support media content in HTML5.",
    "state the difference between span tag and div tag in HTML5.",
    "explain HTML5 Web storage.",
    "explain DOM (Document Object Model).",
    "what do you know about pair programming?",
    "while building a web application, how do you consider SEO, maintainability, UX, performance, and security?",
    "state the difference between SVG (Scalable Vector Graphics) and Canvas.",
    "what is type coercion in JavaScript?",
    "State the difference between <window.onload> and <onDocumentReady>?",
    "describe the different kinds of HTTP requests supported by RESTful Web services.",
    "how does CORS work?",
    "what is an entity tag?",
    "can you define what long polling is?",
    "what is DTD and what is the difference between PCDATA and CDATA in DTD?",
    "what are the APIs that the HTML5 standard provides?",
    "what is the best way to integrate different style sheets into a website?",
    "how do you optimize the loading time of your web application as a web developer?",
    "define NPM (Node Package Manager).",
    "what are the different popup boxes that are available in JavaScript? ",
    "explain the term “Scope” in JavaScript and write its different types.",
    "can you explain what AJAX is?",
    "what do you mean by CDN (Content Delivery Network) in jQuery?",
    "explain W3C (World Wide Consortium).",
    "what do you mean by CSS Selectors? name a few.",
    "in CSS, there are numerous different sorts of selectors. give some examples.",
    "how do pseudo-classes work?",
    "why are media queries used in CSS?",
    "state difference between Local Storage and Cookies.",
    "what is the purpose of Canvas in HTML?",
    "what is the purpose of closures in JavaScript?",
    "what is an event loop in Node JS?",
    "what is a blocking code?",
    "what is the CSS grid system?",
    "can you compare MongoDB and SQL Databases?",
    "what is the difference between SOAP and REST?",
    "what is the use of a namespace in web development?",
    "what are the form elements that support media content in HTML5?",
    "what is the difference between localStorage and sessionStorage objects?",
    "what are some of the new features that are introduced in CSS3?",
    "what is responsive web design (RWD) in HTML and CSS?",
    "what are some of the types of CSS that are used?",
    "what is pagination? how can pagination be implemented?",
    "what are some of the Web Development technologies that you know?"
  ],
  "software engineering": [
    "what are the various categories of software?",
    "what are the characteristics of software?",
    "what is a framework?",
    "what is the main difference between a computer program and computer software?",
    "describe the software development process in brief.",
    "what are different SDLC models available?",
    "which SDLC model is the best?",
    "what is debugging?",
    "what does a software project manager do?",
    "what is the waterfall method and what are its use cases?",
    "what is software scope?",
    "what are the merits of the incremental model?",
    "what is software prototyping and POC?",
    "what are the drawbacks of the spiral model?",
    "what is baseline in software development?",
    "what is SRS?",
    "what are CASE tools?",
    "what are verification and validation?",
    "what do you mean by Software re-engineering?",
    "what is the feasibility study?",
    "define black box testing and white box testing?",
    "what is concurrency?",
    "what are software metrics?",
    "what is the difference between cohesion and coupling?",
    "what is Data Flow Diagram?",
    "explain the concept of modularization.",
    "what is software configuration management?",
    "what are functional and non-functional requirements?",
    "what is the difference between quality assurance and quality control?",
    "what programming languages are you familiar with?",
    "what are your thoughts on declarative vs. imperative paradigms such as functional and object-oriented programming?",
    "what are your most used design patterns and in what contexts do you use them?",
    "what is “Agile” software development and what are your thoughts on it?",
    "what are your thoughts on software testing?",
    "describe a difficult bug you were tasked with fixing in a large application. how did you debug the issue?",
    "how do you explain technical challenges to stakeholders who do not have technical knowledge or backgrounds?"
  ],
  "backend": [
    "what is a backend developer?",
    "explain the purpose of the backend?",
    "what is a typical workflow for implementing a new feature on the backend?",
    "explain the essence of DRY and DIE principles?",
    "what is a web server?",
    "what is the difference between a GET and a POST request?",
    "what is an example of when you would use caching?",
    "how would you select a cache strategy (e.g., LRU, FIFO)?",
    "what are some common issues with ORMs?",
    "when should you use asynchronous programming?",
    "what is the difference between promises and callbacks?",
    "what is closure?",
    "what is the difference between a class and an interface in java?",
    "what is continuous integration?",
    "what is a software development kit (SDK)?",
    "what are the tradeoffs of client-side rendering vs. server-side rendering?",
    "what are high-order functions? why are they useful?",
    "what is a microservice?",
    "how would you design an API?",
    "what is the difference between a RESTful and a SOAP API?",
    "how do you handle errors when making API calls?",
    "what is a database?",
    "how would you handle optimizing an existing database?",
    "what is the difference between a relational and a non-relational database?",
    "how would you query data from a MongoDB database?",
    "what are some benefits of using a NoSQL database?"
  ],
  "frontend": [
    "what skills does a front-end developer need?",
    "define HTML meta tags.",
    "differentiate between div and span?",
    "what is React JS?",
    "describe the advantages of REST web services?",
    "how browsers render the UI?",
    "what is a grid system in CSS?",
    "describe the distinction between class and prototypal inheritance in javascript?",
    "explain user-centered design?",
    "what is clickJacking?",
    "tell me when and why should I make use of webpack?",
    "mention three ways to decrease page load time?",
    "how does the server hanger the page in which content is present in several languages?",
    "why did we utilize the data- the attribute in HTML and why it is now advised not to use?",
    "mention the benefits of CoffeeScript over JavaScript?",
    "what is stringify?",
    "state all the elements of the CSS box model.",
    "what is progressive rendering?",
    "in an image tag, what is the benefit of the srcset attribute?",
    "mention the difference between MySQL and MongoDB?",
    "define the anonymous function in JS?",
    "what do you know about the CSS image sprites and why it is utilized?",
    "suggest some ways on how to fix the browser-specific styling issue?",
    "mention the pitfalls for using a CSS Preprocessor like Sass?",
    "suggest how can we optimize our front-end page.",
    "what is the difference between attribute and property?",
    "state the difference between == and ===?",
    "why do we utilize the “use strict”; statement?",
    "name the major HTTP requests"
  ],
  "javascript": [
    "what are the different data types present in javascript?",
    "explain hoisting in javascript.",
    "why do we use the word “debugger” in javascript?",
    "difference between “ == “ and “ === “ operators.",
    "difference between var and let keyword in javascript.",
    "explain implicit type coercion in javascript.",
    "is javascript a statically typed or a dynamically typed language?",
    "what is NaN property in JavaScript?",
    "explain passed by value and passed by reference.",
    "what is an immediately invoked function in JavaScript?",
    "what do you mean by strict mode in javascript and characteristics of javascript strict-mode?",
    "explain higher order functions in javascript.",
    "explain “this” keyword.",
    "what do you mean by self invoking functions?",
    "explain call(), apply() and, bind() methods.",
    "what is the difference between exec () and test () methods in javascript?",
    "what is currying in javaScript?",
    "what are some advantages of using external javaScript?",
    "explain scope and scope chain in javascript.",
    "explain closures in javaScript.",
    "mention some advantages of javascript.",
    "what are object prototypes?",
    "what are callbacks?",
    "what are the types of errors in javascript?",
    "what is memoization?",
    "what is recursion in a programming language?",
    "what is the use of a constructor function in javascript?",
    "what is DOM?",
    "which method is used to retrieve a character from a certain index?",
    "what do you mean by BOM?",
    "what is the distinction between client-side and server-side javaScript?",
    "what are arrow functions?",
    "what do mean by prototype design pattern?",
    "differences between declaring variables using var, let and const.",
    "what is the rest parameter and spread operator?",
    "in JavaScript, how many different methods can you make an object?",
    "what is the use of promises in javascript?",
    "what are classes in javascript?",
    "what are generator functions?",
    "explain WeakSet in javascript.",
    "why do we use callbacks?",
    "explain WeakMap in javascript.",
    "what is object destructuring?",
    "difference between prototypal and classical inheritance",
    "what is a temporal dead zone?",
    "what do you mean by javaScript design patterns?",
    "is javaScript a pass-by-reference or pass-by-value language?",
    "difference between Async/Await and generators usage to achieve the same functionality.",
    "what are the primitive data types in JavaScript?",
    "what is the role of deferred scripts in JavaScript?",
    "what has to be done in order to put Lexical Scoping into practice?",
    "what is the purpose of the following JavaScript code?"
  ],
  "html/css": [],
  "database": []
}